---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MassSurfaceData.IsGlazingShaded
source: html/59b5e249-17e5-7c0b-585b-7f0ce1210b5f.htm
---
# Autodesk.Revit.DB.Analysis.MassSurfaceData.IsGlazingShaded Property

Indicates if shade geometry is auto-generated on the top edge of auto-generated glazing.

## Syntax (C#)
```csharp
public bool IsGlazingShaded { get; set; }
```